#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.notification_hubs_weu.azurerm_monitor_metric_alert.alert_nh_common_anomalous_pns_success_volume will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "alert_nh_common_anomalous_pns_success_volume" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/metricAlerts/[IOCOM|NHLegacy] Push Notification Service anomalous success volume"
        name                     = "[IOCOM|NHLegacy] Push Notification Service anomalous success volume"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.notification_hubs_weu.azurerm_monitor_metric_alert.alert_nh_common_partition_1_anomalous_pns_success_volume will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "alert_nh_common_partition_1_anomalous_pns_success_volume" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/metricAlerts/[IOCOM|NH1] Push Notification Service anomalous success volume"
        name                     = "[IOCOM|NH1] Push Notification Service anomalous success volume"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.notification_hubs_weu.azurerm_monitor_metric_alert.alert_nh_common_partition_1_pns_errors will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "alert_nh_common_partition_1_pns_errors" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/metricAlerts/[IOCOM|NH1] Push Notification Service errors"
        name                     = "[IOCOM|NH1] Push Notification Service errors"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.notification_hubs_weu.azurerm_monitor_metric_alert.alert_nh_common_partition_2_anomalous_pns_success_volume will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "alert_nh_common_partition_2_anomalous_pns_success_volume" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/metricAlerts/[IOCOM|NH2] Push Notification Service anomalous success volume"
        name                     = "[IOCOM|NH2] Push Notification Service anomalous success volume"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.notification_hubs_weu.azurerm_monitor_metric_alert.alert_nh_common_partition_2_pns_errors will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "alert_nh_common_partition_2_pns_errors" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/metricAlerts/[IOCOM|NH2] Push Notification Service errors"
        name                     = "[IOCOM|NH2] Push Notification Service errors"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.notification_hubs_weu.azurerm_monitor_metric_alert.alert_nh_common_partition_3_anomalous_pns_success_volume will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "alert_nh_common_partition_3_anomalous_pns_success_volume" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/metricAlerts/[IOCOM|NH3] Push Notification Service anomalous success volume"
        name                     = "[IOCOM|NH3] Push Notification Service anomalous success volume"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.notification_hubs_weu.azurerm_monitor_metric_alert.alert_nh_common_partition_3_pns_errors will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "alert_nh_common_partition_3_pns_errors" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/metricAlerts/[IOCOM|NH3] Push Notification Service errors"
        name                     = "[IOCOM|NH3] Push Notification Service errors"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.notification_hubs_weu.azurerm_monitor_metric_alert.alert_nh_common_partition_4_anomalous_pns_success_volume will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "alert_nh_common_partition_4_anomalous_pns_success_volume" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/metricAlerts/[IOCOM|NH4] Push Notification Service anomalous success volume"
        name                     = "[IOCOM|NH4] Push Notification Service anomalous success volume"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.notification_hubs_weu.azurerm_monitor_metric_alert.alert_nh_common_partition_4_pns_errors will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "alert_nh_common_partition_4_pns_errors" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/metricAlerts/[IOCOM|NH4] Push Notification Service errors"
        name                     = "[IOCOM|NH4] Push Notification Service errors"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.notification_hubs_weu.azurerm_monitor_metric_alert.alert_nh_common_pns_errors will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "alert_nh_common_pns_errors" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/metricAlerts/[IOCOM|NHLegacy] Push Notification Service errors"
        name                     = "[IOCOM|NHLegacy] Push Notification Service errors"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.redis_messages.azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs            = [
          - {
              - fqdn         = "io-p-itn-msgs-redis-01.redis.cache.windows.net"
              - ip_addresses = [
                  - "10.20.2.26",
                ]
            },
        ] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-msgs-redis-01-private-endpoint" -> (known after apply)
        name                          = "io-p-itn-msgs-redis-01-private-endpoint"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-msgs-redis-01-private-endpoint.nic.176907d5-d7ba-49b2-a79f-565ad5ad7f45"
              - name = "io-p-itn-msgs-redis-01-private-endpoint.nic.176907d5-d7ba-49b2-a79f-565ad5ad7f45"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [] -> (known after apply)
        tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "io-p-itn-msgs-redis-01-private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      ~ private_service_connection {
            name                              = "io-p-itn-msgs-redis-01-private-service-connection"
          ~ private_connection_resource_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Cache/redis/io-p-itn-msgs-redis-01" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.20.2.26" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.redis_messages.azurerm_redis_cache.this must be replaced
-/+ resource "azurerm_redis_cache" "this" {
      ~ capacity                           = 1 -> 2
      ~ family                             = "P" -> "C"
      ~ hostname                           = "io-p-itn-msgs-redis-01.redis.cache.windows.net" -> (known after apply)
      ~ id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Cache/redis/io-p-itn-msgs-redis-01" -> (known after apply)
        name                               = "io-p-itn-msgs-redis-01"
      ~ port                               = 6379 -> (known after apply)
      ~ primary_access_key                 = (sensitive value)
      ~ primary_connection_string          = (sensitive value)
      + private_static_ip_address          = (known after apply)
      ~ redis_version                      = "6.0" -> "6"
      ~ replicas_per_master                = 1 -> (known after apply)
      ~ replicas_per_primary               = 1 -> (known after apply)
      ~ secondary_access_key               = (sensitive value)
      ~ secondary_connection_string        = (sensitive value)
      - shard_count                        = 0 -> null
      ~ sku_name                           = "Premium" -> "Standard" # forces replacement
      ~ ssl_port                           = 6380 -> (known after apply)
        tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      - tenant_settings                    = {} -> null
      - zones                              = [ # forces replacement
          - "1",
          - "2",
        ] -> null
        # (7 unchanged attributes hidden)

      ~ redis_configuration {
          - active_directory_authentication_enabled = false -> null
          - aof_backup_enabled                      = false -> null
          ~ maxclients                              = 7500 -> (known after apply)
          ~ maxfragmentationmemory_reserved         = 642 -> (known after apply)
          ~ maxmemory_delta                         = 642 -> (known after apply)
          ~ maxmemory_reserved                      = 642 -> (known after apply)
          - rdb_backup_frequency                    = 0 -> null
          - rdb_backup_max_snapshot_count           = 0 -> null
            # (9 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.storage_api_weu.azurerm_monitor_metric_alert.iopstapi_throttling_low_availability will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "iopstapi_throttling_low_availability" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.Insights/metricAlerts/[IO-COMMONS | iopstapi] Low Availability"
        name                     = "[IO-COMMONS | iopstapi] Low Availability"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.citizen_func_api will be destroyed
  # (because resource uses count or for_each)
  - resource "azurerm_cosmosdb_sql_role_assignment" "citizen_func_api" {
      - account_name        = "io-p-cosmos-api" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlRoleAssignments/5d063738-eef9-2f95-dcfb-7b15d737d673" -> null
      - name                = "5d063738-eef9-2f95-dcfb-7b15d737d673" -> null
      - principal_id        = "68e59eb6-1a21-4e16-88ed-724e1cc313c1" -> null
      - resource_group_name = "io-p-rg-internal" -> null
      - role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api" -> null
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.citizen_func_api["68e59eb6-1a21-4e16-88ed-724e1cc313c1"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "citizen_func_api" {
      + account_name        = "io-p-cosmos-api"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "68e59eb6-1a21-4e16-88ed-724e1cc313c1"
      + resource_group_name = "io-p-rg-internal"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.citizen_func_api["e52f57fa-250f-43d3-9dac-933c124df9b1"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "citizen_func_api" {
      + account_name        = "io-p-cosmos-api"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "e52f57fa-250f-43d3-9dac-933c124df9b1"
      + resource_group_name = "io-p-rg-internal"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.citizen_func_com will be destroyed
  # (because resource uses count or for_each)
  - resource "azurerm_cosmosdb_sql_role_assignment" "citizen_func_com" {
      - account_name        = "io-p-itn-com-cosno-01" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/sqlRoleAssignments/9a9003a1-1b3e-47b0-aaa2-da334555e17a" -> null
      - name                = "9a9003a1-1b3e-47b0-aaa2-da334555e17a" -> null
      - principal_id        = "68e59eb6-1a21-4e16-88ed-724e1cc313c1" -> null
      - resource_group_name = "io-p-itn-com-rg-01" -> null
      - role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01" -> null
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.citizen_func_com["68e59eb6-1a21-4e16-88ed-724e1cc313c1"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "citizen_func_com" {
      + account_name        = "io-p-itn-com-cosno-01"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "68e59eb6-1a21-4e16-88ed-724e1cc313c1"
      + resource_group_name = "io-p-itn-com-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "68e59eb6-1a21-4e16-88ed-724e1cc313c1"
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.citizen_func_com["e52f57fa-250f-43d3-9dac-933c124df9b1"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "citizen_func_com" {
      + account_name        = "io-p-itn-com-cosno-01"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "68e59eb6-1a21-4e16-88ed-724e1cc313c1"
      + resource_group_name = "io-p-itn-com-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "e52f57fa-250f-43d3-9dac-933c124df9b1"
    }

  # module.web_apps.azurerm_redis_cache_access_policy_assignment.etl_func_redis_access_policy must be replaced
-/+ resource "azurerm_redis_cache_access_policy_assignment" "etl_func_redis_access_policy" {
      ~ id                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Cache/redis/io-p-itn-msgs-redis-01/accessPolicyAssignments/etl_func" -> (known after apply)
        name               = "etl_func"
      ~ redis_cache_id     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Cache/redis/io-p-itn-msgs-redis-01" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.web_apps.azurerm_role_assignment.citizen_func_cosmosdb_account_api will be destroyed
  # (because resource uses count or for_each)
  - resource "azurerm_role_assignment" "citizen_func_cosmosdb_account_api" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/providers/Microsoft.Authorization/roleAssignments/3fd21065-8025-410a-ec34-3d2e6d0b3686" -> null
      - name                                   = "3fd21065-8025-410a-ec34-3d2e6d0b3686" -> null
      - principal_id                           = "68e59eb6-1a21-4e16-88ed-724e1cc313c1" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/9b7fa17d-e63e-47b0-bb0a-15c516ac86ec" -> null
      - role_definition_name                   = "SQL DB Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01" -> null
        # (4 unchanged attributes hidden)
    }

  # module.web_apps.azurerm_role_assignment.citizen_func_cosmosdb_account_api["68e59eb6-1a21-4e16-88ed-724e1cc313c1"] will be created
  + resource "azurerm_role_assignment" "citizen_func_cosmosdb_account_api" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "68e59eb6-1a21-4e16-88ed-724e1cc313c1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.citizen_func_cosmosdb_account_api["e52f57fa-250f-43d3-9dac-933c124df9b1"] will be created
  + resource "azurerm_role_assignment" "citizen_func_cosmosdb_account_api" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e52f57fa-250f-43d3-9dac-933c124df9b1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.citizen_func_io_com_cosmos will be destroyed
  # (because resource uses count or for_each)
  - resource "azurerm_role_assignment" "citizen_func_io_com_cosmos" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/providers/Microsoft.Authorization/roleAssignments/336cbebc-60ad-4472-7ebe-91c538a35059" -> null
      - name                                   = "336cbebc-60ad-4472-7ebe-91c538a35059" -> null
      - principal_id                           = "68e59eb6-1a21-4e16-88ed-724e1cc313c1" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/9b7fa17d-e63e-47b0-bb0a-15c516ac86ec" -> null
      - role_definition_name                   = "SQL DB Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01" -> null
        # (4 unchanged attributes hidden)
    }

  # module.web_apps.azurerm_role_assignment.citizen_func_io_com_cosmos["68e59eb6-1a21-4e16-88ed-724e1cc313c1"] will be created
  + resource "azurerm_role_assignment" "citizen_func_io_com_cosmos" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "68e59eb6-1a21-4e16-88ed-724e1cc313c1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.citizen_func_io_com_cosmos["e52f57fa-250f-43d3-9dac-933c124df9b1"] will be created
  + resource "azurerm_role_assignment" "citizen_func_io_com_cosmos" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e52f57fa-250f-43d3-9dac-933c124df9b1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01"
        name                                           = "io-p-itn-msgs-sending-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "SLOT_TASK_HUBNAME",
                "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "AzureFunctionsWebHost__hostid",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-msgs-sending-func-01] Health Check Failed"
        name                     = "io-p-itn-msgs-sending-func-01] Health Check Failed"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.web_apps.module.citizen_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-citizen-func-01"
        name                                           = "io-p-itn-com-citizen-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps.module.citizen_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-citizen-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.citizen_func.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-com-citizen-func-01] Health Check Failed"
        name                     = "io-p-itn-com-citizen-func-01] Health Check Failed"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (9 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

        # (1 unchanged block hidden)
    }

  # module.web_apps.module.etl_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-etl-func-01"
        name                                           = "io-p-itn-com-etl-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps.module.etl_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-etl-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.etl_func.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-com-etl-func-01] Health Check Failed"
        name                     = "io-p-itn-com-etl-func-01] Health Check Failed"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

        # (1 unchanged block hidden)
    }

Plan: 11 to add, 20 to change, 7 to destroy.

Warning: Argument is deprecated

  with module.storage_api_weu.azurerm_storage_container.message_content,
  on ../_modules/storage_accounts/storage_account_api.tf line 32, in resource "azurerm_storage_container" "message_content":
  32:   storage_account_name  = module.storage_api.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
